
class MSG_TEXT:
    start_user_new = " Добро пожаловать! \nВведите пожалуйста ваш город на английском."
    start_user_exist = " Добро пожаловать!"

    new_timezone = "Введите пожалуйста ваш город на английском."

    choose_interval = "Выберите интервал для настройки"
    choose_settings = "Выберите настройки"

    choose_interval_upper = "Выберите верхнюю границу интервала - _interval_"
    choose_interval_lower = "Выберите нижнюю границу интервала - _interval_"

    send_imgs = "Отправьте изображения для интервала _interval_.\nПосле того, как все изображения отправлены, нажмите кнопку Продолжить."

    data_done = "Данные успешно приняты!"
    error_location = "Город не найден! Попробуйте еще раз."


class BUTTON_TEXT:
    notification_settings = 'Настроить уведомления'
    notification_settings_time = 'Изменить интервал'
    notification_settings_imgs = 'Добавить изображения'

    new_timezone = "Сменить город"

    morning = "Утро"
    noon = "День"
    evening = "Вечер"

    next_b = 'Продолжить'

    feedback_good = 'Как раз вовремя!'
    feedback_bad = 'Не сейчас'

    feedback_good_done = '👍 Как раз вовремя!'
    feedback_bad_done = '👎 Не сейчас'




